app/Http/Controllers/ClientController.php

select * from `users` where `created_by` = 2 and `type` = 'client'
---
    public function index()
    {
        if(\Auth::user()->can('manage client'))
        {
            $user    = \Auth::user();
            $clients = User::where('created_by', '=', $user->creatorId())->where('type', '=', 'client')->get();