app/Http/Controllers/DashboardController.php

    public function account_dashboard_index()
    {

        if (Auth::check()) {

            if (Auth::user()->type == 'super admin') {
                return redirect()->route('client.dashboard.view');
            } elseif (Auth::user()->type == 'client') {
                return redirect()->route('client.dashboard.view');
            } else {
                if (Auth::user()->can('show account dashboard')) {
                    $data['latestIncome'] = Revenue::with(['customer'])->where('created_by', '=', Auth::user()->creatorId())->orderBy('id', 'desc')->limit(5)->get();
                    $data['latestExpense'] = Payment::with(['vender'])->where('created_by', '=', Auth::user()->creatorId())->orderBy('id', 'desc')->limit(5)->get();
                    $currentYer = date('Y');

                    $incomeCategory = ProductServiceCategory::where('created_by', '=', Auth::user()->creatorId())
                        ->where('type', '=', 'income')->get();
---
select * from `revenues` where `created_by` = 2 order by `id` desc limit 5
select * from `payments` where `created_by` = 2 order by `id` desc limit 5
select * from `product_service_categories` where `created_by` = 2 and `type` = 'income'

                    $data['incomeCategory'] = $inCategory;
                    $data['incomeCatAmount'] = $inAmount;

                    $expenseCategory = ProductServiceCategory::where('created_by', '=', Auth::user()->creatorId())
                        ->where('type', '=', 'expense')->get();
---
select * from `product_service_categories` where `created_by` = 2 and `type` = 'expense'

                    $data['currentYear'] = date('Y');
                    $data['currentMonth'] = date('M');

                    $constant['taxes'] = Tax::where('created_by', Auth::user()->creatorId())->count();
                    $constant['category'] = ProductServiceCategory::where('created_by', Auth::user()->creatorId())->count();
                    $constant['units'] = ProductServiceUnit::where('created_by', Auth::user()->creatorId())->count();
                    $constant['bankAccount'] = BankAccount::where('created_by', Auth::user()->creatorId())->count();
                    $data['constant'] = $constant;
                    $data['bankAccountDetail'] = BankAccount::where('created_by', '=', Auth::user()->creatorId())->limit(5)->get();
                    $data['recentInvoice'] = Invoice::join('customers', 'invoices.customer_id', '=', 'customers.id')
                        ->where('invoices.created_by', '=', Auth::user()->creatorId())
                        ->orderBy('invoices.id', 'desc')
                        ->limit(5)
                        ->select('invoices.*', 'customers.name as customer_name')
                        ->get();

                    $data['weeklyInvoice'] = Auth::user()->weeklyInvoice();
                    $data['monthlyInvoice'] = Auth::user()->monthlyInvoice();
                    $data['recentBill'] = Bill::join('venders', 'bills.vender_id', '=', 'venders.id')
                    ->where('bills.created_by', '=', Auth::user()->creatorId())
                    ->orderBy('bills.id', 'desc')
                    ->limit(5)
                    ->select('bills.*', 'venders.name as vender_name')
                    ->get();

                    $data['weeklyBill'] = Auth::user()->weeklyBill();
                    $data['monthlyBill'] = Auth::user()->monthlyBill();
                    $data['goals'] = Goal::where('created_by', '=', Auth::user()->creatorId())->where('is_display', 1)->get();

                    //Storage limit
                    $data['users'] = User::find(Auth::user()->creatorId());
---
select count(*) as aggregate from `taxes` where `created_by` = 2
select count(*) as aggregate from `product_service_categories` where `created_by` = 2
select count(*) as aggregate from `product_service_units` where `created_by` = 2
select count(*) as aggregate from `bank_accounts` where `created_by` = 2
select * from `bank_accounts` where `created_by` = 2 limit 5
select `invoices`.*, `customers`.`name` as `customer_name` from `invoices` inner join `customers` on `invoices`.`customer_id` = `customers`.`id` where `invoices`.`created_by` = 2 order by `invoices`.`id` desc limit 5
select `bills`.*, `venders`.`name` as `vender_name` from `bills` inner join `venders` on `bills`.`vender_id` = `venders`.`id` where `bills`.`created_by` = 2 order by `bills`.`id` desc limit 5
select * from `goals` where `created_by` = 2 and `is_display` = 1
select * from `users` where `users`.`id` = 2 limit 1

    public function project_dashboard_index()
    {
        $user = Auth::user();

        if (Auth::user()->can('show project dashboard')) {
            if ($user->type == 'admin') {
                return view('admin.dashboard');
            } else {
                $home_data = [];

                $user_projects = $user->projects()->pluck('project_id')->toArray();

                $project_tasks = ProjectTask::whereIn('project_id', $user_projects)->get();
                $project_expense = Expense::whereIn('project_id', $user_projects)->get();
                $seven_days = Utility::getLastSevenDays();

                // Total Projects
                $complete_project = $user->projects()->where('status', 'LIKE', 'complete')->count();
                $home_data['total_project'] = [
                    'total' => count($user_projects),
                    'percentage' => Utility::getPercentage($complete_project, count($user_projects)),
                ];

                // Total Tasks
                $complete_task = ProjectTask::where('is_complete', '=', 1)->whereRaw("find_in_set('" . $user->id . "',assign_to)")->whereIn('project_id', $user_projects)->count();
                $home_data['total_task'] = [
                    'total' => $project_tasks->count(),
                    'percentage' => Utility::getPercentage($complete_task, $project_tasks->count()),
                ];
---
select `project_id` from `projects` inner join `project_users` on `projects`.`id` = `project_users`.`project_id` where `project_users`.`user_id` = 2
select count(*) as aggregate from `projects` inner join `project_users` on `projects`.`id` = `project_users`.`project_id` where `project_users`.`user_id` = 2 and `status` LIKE 'complete'
select count(*) as aggregate from `project_tasks` where `is_complete` = 1 and find_in_set('2',assign_to) and 0 = 1

                $timesheet_logged = [];
                foreach ($seven_days as $date => $day) {
                    // Task
                    $task_overview[$day] = ProjectTask::where('is_complete', '=', 1)->where('marked_at', 'LIKE', $date)->whereIn('project_id', $user_projects)->count();
---
select count(*) as aggregate from `project_tasks` where `is_complete` = 1 and `marked_at` LIKE '2025-05-29' and 0 = 1

                $home_data['project_status'] = $project_status;

                // Top Due Project
                $home_data['due_project'] = $user->projects()->orderBy('end_date', 'DESC')->limit(5)->get();
---
select `projects`.*, `project_users`.`user_id` as `pivot_user_id`, `project_users`.`project_id` as `pivot_project_id`, `project_users`.`created_at` as `pivot_created_at`, `project_users`.`updated_at` as `pivot_updated_at` from `projects` inner join `project_users` on `projects`.`id` = `project_users`.`project_id` where `project_users`.`user_id` = 2 order by `end_date` desc limit 5

    public function clientView()
    {

        if (Auth::check()) {
            if (Auth::user()->type == 'super admin') {
                $user = Auth::user();
                $user['total_user'] = $user->countCompany();
                $user['total_paid_user'] = $user->countPaidCompany();
                $user['total_orders'] = Order::total_orders();
                $user['total_orders_price'] = Order::total_orders_price();
                $user['total_plan'] = Plan::total_plan();
                if(!empty(Plan::most_purchese_plan()))
                {
                    $plan = Plan::find(Plan::most_purchese_plan()['plan']);
---
select * from `plans` where `plans`.`id` = 2 limit 1

    public function getOrderChart($arrParam)
    {
        $arrDuration = [];
        if ($arrParam['duration']) {
            if ($arrParam['duration'] == 'week') {
                $previous_week = strtotime("-2 week +1 day");
                for ($i = 0; $i < 14; $i++) {
                    $arrDuration[date('Y-m-d', $previous_week)] = date('d-M', $previous_week);
                    $previous_week = strtotime(date('Y-m-d', $previous_week) . " +1 day");
                }
            }
        }

        $arrTask = [];
        $arrTask['label'] = [];
        $arrTask['data'] = [];
        foreach ($arrDuration as $date => $label) {

            $data = Order::select(\DB::raw('count(*) as total'))->whereDate('created_at', '=', $date)->first();
---
select count(*) as total from `orders` where date(`created_at`) = '2025-05-11' limit 1