app/Http/Controllers/ReportController.php

            ->get()
            ->toArray();

        $receivableSummariesCredit = CreditNote::select('customers.name')
            ->selectRaw('null as invoice')
            ->selectRaw('(credit_notes.amount) as price')
            ->selectRaw('0 as pay_price')
            ->selectRaw('0 as total_tax')
            ->selectRaw('credit_notes.date as issue_date')
            ->selectRaw('5 as status')
            ->leftJoin('customers', 'customers.id', 'credit_notes.customer')
            ->leftJoin('invoice_products', 'invoice_products.invoice_id', 'credit_notes.invoice')
            ->leftJoin('invoices', 'invoices.id', 'credit_notes.invoice')
            ->where('invoices.created_by', \Auth::user()->creatorId())
            ->where('credit_notes.date', '>=', $start)
            ->where('credit_notes.date', '<=', $end)
            ->groupBy('credit_notes.id')
            ->get()
            ->toArray();

        $receivableSummaries = (array_merge($receivableSummariesCredit, $receivableSummariesInvoice));

        $receivableDetailsInvoice = Invoice::select('customers.name')
            ->selectRaw('(invoices.invoice_id) as invoice')
            ->selectRaw('sum(invoice_products.price) as price')
            ->selectRaw('(invoice_products.quantity) as quantity')
            ->selectRaw('(product_services.name) as product_name')
            ->selectRaw('invoices.issue_date as issue_date')
            ->selectRaw('invoices.status as status')
            ->leftJoin('customers', 'customers.id', 'invoices.customer_id')
            ->leftJoin('invoice_products', 'invoice_products.invoice_id', 'invoices.id')
            ->leftJoin('product_services', 'product_services.id', 'invoice_products.product_id')
            ->where('invoices.created_by', \Auth::user()->creatorId())
            ->where('invoices.issue_date', '>=', $start)
            ->where('invoices.issue_date', '<=', $end)
            ->groupBy('invoices.invoice_id', 'product_services.name')
            ->get()
            ->toArray();

        $receivableDetailsCredit = CreditNote::select('customers.name')
            ->selectRaw('null as invoice')
            ->selectRaw('(credit_notes.id) as invoices')
            ->selectRaw('(credit_notes.amount) as price')
            ->selectRaw('(product_services.name) as product_name')
            ->selectRaw('credit_notes.date as issue_date')
            ->selectRaw('5 as status')
            ->leftJoin('customers', 'customers.id', 'credit_notes.customer')
            ->leftJoin('invoice_products', 'invoice_products.invoice_id', 'credit_notes.invoice')
            ->leftJoin('product_services', 'product_services.id', 'invoice_products.product_id')
            ->leftJoin('invoices', 'invoices.id', 'credit_notes.invoice')
            ->where('invoices.created_by', \Auth::user()->creatorId())
            ->where('credit_notes.date', '>=', $start)
            ->where('credit_notes.date', '<=', $end)
            ->groupBy('credit_notes.id', 'product_services.name')
            ->get()
            ->toArray();
---
select `customers`.`name`, (invoices.invoice_id) as invoice, sum((invoice_products.price * invoice_products.quantity) - invoice_products.discount) as price, sum((invoice_payments.amount)) as pay_price, (SELECT SUM((price * quantity - discount) * (taxes.rate / 100)) FROM invoice_products
LEFT JOIN taxes ON FIND_IN_SET(taxes.id, invoice_products.tax) > 0
WHERE invoice_products.invoice_id = invoices.id) as total_tax, invoices.issue_date as issue_date, invoices.status as status from `invoices` left join `customers` on `customers`.`id` = `invoices`.`customer_id` left join `invoice_payments` on `invoice_payments`.`invoice_id` = `invoices`.`id` left join `invoice_products` on `invoice_products`.`invoice_id` = `invoices`.`id` where `invoices`.`created_by` = 2 and `invoices`.`issue_date` >= '2025-01-01' and `invoices`.`issue_date` <= '2025-06-05' group by `invoices`.`invoice_id`
select `customers`.`name`, null as invoice, (credit_notes.amount) as price, 0 as pay_price, 0 as total_tax, credit_notes.date as issue_date, 5 as status from `credit_notes` left join `customers` on `customers`.`id` = `credit_notes`.`customer` left join `invoice_products` on `invoice_products`.`invoice_id` = `credit_notes`.`invoice` left join `invoices` on `invoices`.`id` = `credit_notes`.`invoice` where `invoices`.`created_by` = 2 and `credit_notes`.`date` >= '2025-01-01' and `credit_notes`.`date` <= '2025-06-05' group by `credit_notes`.`id`
select `customers`.`name`, (invoices.invoice_id) as invoice, sum(invoice_products.price) as price, (invoice_products.quantity) as quantity, (product_services.name) as product_name, invoices.issue_date as issue_date, invoices.status as status from `invoices` left join `customers` on `customers`.`id` = `invoices`.`customer_id` left join `invoice_products` on `invoice_products`.`invoice_id` = `invoices`.`id` left join `product_services` on `product_services`.`id` = `invoice_products`.`product_id` where `invoices`.`created_by` = 2 and `invoices`.`issue_date` >= '2025-01-01' and `invoices`.`issue_date` <= '2025-06-05' group by `invoices`.`invoice_id`, `product_services`.`name`
select `customers`.`name`, null as invoice, (credit_notes.id) as invoices, (credit_notes.amount) as price, (product_services.name) as product_name, credit_notes.date as issue_date, 5 as status from `credit_notes` left join `customers` on `customers`.`id` = `credit_notes`.`customer` left join `invoice_products` on `invoice_products`.`invoice_id` = `credit_notes`.`invoice` left join `product_services` on `product_services`.`id` = `invoice_products`.`product_id` left join `invoices` on `invoices`.`id` = `credit_notes`.`invoice` where `invoices`.`created_by` = 2 and `credit_notes`.`date` >= '2025-01-01' and `credit_notes`.`date` <= '2025-06-05' group by `credit_notes`.`id`, `product_services`.`name`