app/Http/Controllers/RoleController.php

    public function index()
    {
        if(\Auth::user()->can('manage role'))
        {

            $roles = Role::where('created_by', '=', \Auth::user()->creatorId())->where('created_by', '=', \Auth::user()->creatorId())->get();
---
select * from `roles` where `created_by` = 2 and `created_by` = 2