app/Http/Controllers/StripePaymentController.php

    public function index()
    {
        $objUser = \Auth::user();

        if ($objUser->type == 'super admin') {
            $orders = Order::select([
                'orders.*',
                'users.name as user_name',
            ])->join('users', 'orders.user_id', '=', 'users.id')->orderBy('orders.created_at', 'DESC')->with('total_coupon_used.coupon_detail')->with(['total_coupon_used.coupon_detail'])->get();

            $userOrders = Order::select('*')
                ->whereIn('id', function ($query) {
                    $query->selectRaw('MAX(id)')
                        ->from('orders')
                        ->groupBy('user_id');
                })
                ->orderBy('created_at', 'desc')
                ->get();
---
select `orders`.*, `users`.`name` as `user_name` from `orders` inner join `users` on `orders`.`user_id` = `users`.`id` order by `orders`.`created_at` desc
select * from `orders` where `id` in (select MAX(id) from `orders` group by `user_id`) order by `created_at` desc