app/Http/Controllers/UserController.php

select * from `plans` where `plans`.`id` in (1)
select * from `users` where `created_by` = 1 and `type` = 'company'
---
  public function index()
  {
    User::defaultEmail();

    $user = Auth::user();
    if (Auth::user()->can('manage user')) {
      if (Auth::user()->type == 'super admin') {
        $users = User::where('created_by', '=', $user->creatorId())->where('type', '=', 'company')->with(['currentPlan'])->get();

select * from `plans`
---
  public function upgradePlan($user_id)
  {
    $user = User::find($user_id);
    $plans = Plan::get();

select * from `users` where `users`.`id` = '6' limit 1
---
  public function activePlan($user_id, $plan_id)
  {

    $plan = Plan::find($plan_id);
    if ($plan->is_disable == 0) {
      return redirect()->back()->with('error', __('You are unable to upgrade this plan because it is disabled.'));
    }

    $user = User::find($user_id);

select * from `users` where `users`.`id` = '2' limit 1
select COUNT(*) as total_users, SUM(CASE WHEN is_disable = 0 THEN 1 ELSE 0 END) as disable_users, SUM(CASE WHEN is_disable = 1 THEN 1 ELSE 0 END) as active_users from `users` where `created_by` = '2' and `type` != 'client' limit 1
---
  public function userUnable(Request $request)
  {
    User::where('id', $request->id)->update(['is_disable' => $request->is_disable]);
    $userData = User::where('created_by', $request->company_id)->where('type', '!=', 'client')->selectRaw('COUNT(*) as total_users, SUM(CASE WHEN is_disable = 0 THEN 1 ELSE 0 END) as disable_users, SUM(CASE WHEN is_disable = 1 THEN 1 ELSE 0 END) as active_users')->first();